src/OneSBuild/src/ChartsOfAccounts/_ДемоОсновной/_ДемоОсновной.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>_ДемоОсновной</name>
  <extDimensionTypes>ChartOfCharacteristicTypes._ДемоВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Вспомогательный</name>
      <description>Вспомогательный</description>
      <code>00</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>НДСПоПриобретеннымЦенностям</name>
      <description>НДС по приобретенным ценностям</description>
      <code>19</code>
      <childItems>
        <name>НДСПоПриобретеннымМПЗ</name>
        <description>НДС по приобретенным материально-производственным запасам</description>
        <code>19.03</code>
      </childItems>
    </items>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>41</code>
      <childItems>
        <name>ТоварыНаСкладах</name>
        <description>Товары на складах</description>
        <code>41.01</code>
      </childItems>
    </items>
    <items>
      <name>РасчетыСПоставщикамиИПодрядчиками</name>
      <description>Расчеты с поставщиками и подрядчиками</description>
      <code>60</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>РасчетыСПоставщиками</name>
        <description>Расчеты с поставщиками и подрядчиками</description>
        <code>60.01</code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>РасчетыСПоставщикамиВал</name>
        <description>Расчеты с поставщиками и подрядчиками (в валюте)</description>
        <code>60.21</code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>РасчетыСПокупателямиИЗаказчиками</name>
      <description>Расчеты с покупателями и заказчиками</description>
      <code>62</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>РасчетыСПокупателями</name>
        <description>Расчеты с покупателями</description>
        <code>62.01</code>
      </childItems>
      <childItems>
        <name>РасчетыСПокупателямиВал</name>
        <description>Расчеты с покупателями и заказчиками (в валюте)</description>
        <code>62.21</code>
      </childItems>
    </items>
    <items>
      <name>РасчетыПоНалогам</name>
      <description>Расчеты по налогам и сборам</description>
      <code>68</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>НДС</name>
        <description>Налог на добавленную стоимость</description>
        <code>68.02</code>
        <accountType>ActivePassive</accountType>
      </childItems>
    </items>
    <items>
      <name>Продажи</name>
      <description>Продажи</description>
      <code>90</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>Выручка</name>
        <description>Выручка</description>
        <code>90.01</code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>СебестоимостьПродаж</name>
        <description>Себестоимость продаж</description>
        <code>90.02</code>
      </childItems>
      <childItems>
        <name>Продажи_НДС</name>
        <description>Продажи НДС</description>
        <code>90.03</code>
      </childItems>
    </items>
  </predefined>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <accountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
  <extDimensionAccountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
  <extDimensionAccountingFlags>
    <name>Суммовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

src/OneSBuild/src/ChartsOfAccounts/_ДемоОсновной/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
//
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов

// Возвращаемое значение:
//   см. ЗапретРедактированияРеквизитовОбъектовПереопределяемый.ПриОпределенииЗаблокированныхРеквизитов.ЗаблокированныеРеквизиты.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	БлокируемыеРеквизиты = Новый Массив;
	БлокируемыеРеквизиты.Добавить("Код");
	БлокируемыеРеквизиты.Добавить("Родитель");
	БлокируемыеРеквизиты.Добавить("Вид");
	БлокируемыеРеквизиты.Добавить("Забалансовый");
	БлокируемыеРеквизиты.Добавить("Валютный");
	БлокируемыеРеквизиты.Добавить("Количественный");
	БлокируемыеРеквизиты.Добавить("ВидыСубконто");
	
	Возврат БлокируемыеРеквизиты;
	
КонецФункции

// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНастройкеНачальногоЗаполненияЭлементов
// 
// Параметры:
//  Настройки - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНастройкеНачальногоЗаполненияЭлементов.Настройки
//
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов
// 
// Параметры:
//   КодыЯзыков - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.КодыЯзыков
//   Элементы - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.Элементы
//   ТабличныеЧасти - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.ТабличныеЧасти
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	

	Элемент = Элементы.Добавить(); // ПланСчетовОбъект._ДемоОсновной
	Элемент.ИмяПредопределенныхДанных = "ТоварыНаСкладах";
	Элемент.Наименование = НСтр("ru = 'Товары на складах'", ОбщегоНазначения.КодОсновногоЯзыка()); 
	Элемент.Вид = ВидСчета.Активный;
	
	Элемент = Элементы.Добавить(); // ПланСчетовОбъект._ДемоОсновной
	Элемент.ИмяПредопределенныхДанных = "СебестоимостьПродаж";
	Элемент.Наименование = НСтр("ru = 'Себестоимость продаж'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.Вид = ВидСчета.Активный;
	
	Элемент = Элементы.Добавить(); // ПланСчетовОбъект._ДемоОсновной
	Элемент.ИмяПредопределенныхДанных = "НДС";
	Элемент.Наименование = НСтр("ru = 'Налог на добавленную стоимость'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.Вид = ВидСчета.Активный;
	
	Элемент = Элементы.Добавить(); // ПланСчетовОбъект._ДемоОсновной
	Элемент.ИмяПредопределенныхДанных = "РасчетыСПокупателямиВал";
	Элемент.Наименование = НСтр("ru = 'Расчеты с покупателями и заказчиками (в валюте)'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.Вид = ВидСчета.Активный;
	
	Элемент = Элементы.Добавить(); // ПланСчетовОбъект._ДемоОсновной
	Элемент.ИмяПредопределенныхДанных = "РасчетыСПоставщикамиВал";
	Элемент.Наименование = НСтр("ru = 'Расчеты с поставщиками и подрядчиками (в валюте)'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.Вид = ВидСчета.Пассивный;
	
	Элемент = Элементы.Добавить(); // ПланСчетовОбъект._ДемоОсновной
	Элемент.ИмяПредопределенныхДанных = "Вспомогательный";
	Элемент.Наименование = НСтр("ru = 'Вспомогательный'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.Вид = ВидСчета.АктивноПассивный;
	
	Элемент = Элементы.Добавить(); // ПланСчетовОбъект._ДемоОсновной
	Элемент.ИмяПредопределенныхДанных = "РасчетыСПокупателямиИЗаказчиками";
	Элемент.Наименование = НСтр("ru = 'Расчеты с покупателями и заказчиками'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.Вид = ВидСчета.АктивноПассивный;

	Элемент = Элементы.Добавить(); // ПланСчетовОбъект._ДемоОсновной
	Элемент.ИмяПредопределенныхДанных = "РасчетыСПокупателями";
	Элемент.Наименование = НСтр("ru = 'Расчеты с покупателями'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.Вид = ВидСчета.Активный;
	
	Элемент = Элементы.Добавить(); // ПланСчетовОбъект._ДемоОсновной
	Элемент.ИмяПредопределенныхДанных = "РасчетыПоНалогам";
	Элемент.Наименование = НСтр("ru = 'Расчеты по налогам и сборам'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.Вид = ВидСчета.АктивноПассивный;
	
	Элемент = Элементы.Добавить(); // ПланСчетовОбъект._ДемоОсновной
	Элемент.ИмяПредопределенныхДанных = "НДСПоПриобретеннымЦенностям";
	Элемент.Наименование = НСтр("ru = 'НДС по приобретенным ценностям'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.Вид = ВидСчета.Активный;
	
	Элемент = Элементы.Добавить(); // ПланСчетовОбъект._ДемоОсновной
	Элемент.ИмяПредопределенныхДанных = "Выручка";
	Элемент.Наименование = НСтр("ru = 'Выручка'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.Вид = ВидСчета.Пассивный;
	
	Элемент = Элементы.Добавить(); // ПланСчетовОбъект._ДемоОсновной
	Элемент.ИмяПредопределенныхДанных = "НДСПоПриобретеннымМПЗ";
	Элемент.Наименование = НСтр("ru = 'НДС по приобретенным материально-производственным запасам'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.Вид = ВидСчета.Активный;
	
	Элемент = Элементы.Добавить(); // ПланСчетовОбъект._ДемоОсновной
	Элемент.ИмяПредопределенныхДанных = "Товары";
	Элемент.Наименование = НСтр("ru = 'Товары'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.Вид = ВидСчета.Активный;
	
	Элемент = Элементы.Добавить(); // ПланСчетовОбъект._ДемоОсновной
	Элемент.ИмяПредопределенныхДанных = "РасчетыСПоставщиками";
	Элемент.Наименование = НСтр("ru = 'Расчеты с поставщиками и подрядчиками'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.Вид = ВидСчета.Пассивный;
	
	Элемент = Элементы.Добавить(); // ПланСчетовОбъект._ДемоОсновной
	Элемент.ИмяПредопределенныхДанных = "Продажи_НДС";
	Элемент.Наименование = НСтр("ru = 'Продажи НДС'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.Вид = ВидСчета.АктивноПассивный;
	
	Элемент = Элементы.Добавить(); // ПланСчетовОбъект._ДемоОсновной
	Элемент.ИмяПредопределенныхДанных = "Продажи";
	Элемент.Наименование = НСтр("ru = 'Продажи'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.Вид = ВидСчета.АктивноПассивный;
	
	Элемент = Элементы.Добавить(); // ПланСчетовОбъект._ДемоОсновной
	Элемент.ИмяПредопределенныхДанных = "РасчетыСПоставщикамиИПодрядчиками";
	Элемент.Наименование = НСтр("ru = 'Расчеты с поставщиками и подрядчиками'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.Вид = ВидСчета.АктивноПассивный;
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНастройкеНачальногоЗаполненияЭлементов
//
// Параметры:
//  Объект                  - ПланСчетовОбъект._ДемоОсновной - заполняемый объект.
//  Данные                  - СтрокаТаблицыЗначений - данные заполнения объекта.
//  ДополнительныеПараметры - Структура:
//   * ПредопределенныеДанные - ТаблицаЗначений - данные заполненные в процедуре ПриНачальномЗаполненииЭлементов.
//
Процедура ПриНачальномЗаполненииЭлемента(Объект, Данные, ДополнительныеПараметры) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
